# PathDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultDivideSettings..::..PathDistance Property
DefaultDivideSettings Class See Also
---
A default Divided Path distance for a fixed, minimum, or maximum distance layout.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double PathDistance { get; set; }
```

Visual Basic
---
```text
Public Property PathDistance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double PathDistance {
	double get ();
	void set (double value);
}
```

# See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace